Учет_ФК/src/Documents/АктПриемаПродукцииЗаПериод/АктПриемаПродукцииЗаПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемаПродукцииЗаПериод</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияАктаОПриемке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияАктаВыявленныхнарушений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыПоступления</name>
    <attributes>
      <name>ДокуменПоступленияИзТранспортировки</name>
      <type>
        <types>DocumentRef.ПоступлениеПродукцииИзТранспортировки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесПродукцииПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комиссия</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СлужбаБезопасности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/Documents/ПоступлениеПродукцииИзТранспортировки/ПоступлениеПродукцииИзТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеПродукцииИзТранспортировки</name>
  <basedOn>Document.ТранспортировкаПродукции</basedOn>
  <registerRecords>AccumulationRegister.ПродукцияВПути</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоперевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.ТранспортировкаПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтметкаОПолучении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаВПриемеПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыявленноеНарушение</name>
      <type>
        <types>CatalogRef.ВидыНарушенийПриТранспортировке</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/Documents/АктПриемаПродукцииЗаПериод/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДобавитьДокументыЗаПериод(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		
		
		параметрыФормы = Новый Структура;
		параметрыФормы.Вставить("СкладПолучатель"	,Объект.Склад);
		параметрыФормы.Вставить("Организация"		,Объект.Организация);
		параметрыФормы.Вставить("РежимВыбора"		,Истина);
		параметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца"		,Истина);
		параметрыФормы.Вставить("ЗакрыватьПриВыборе"		,Ложь);
		ФормаВыбора = ПолучитьФорму("Документ.ПоступлениеПродукцииИзТранспортировки.ФормаВыбора",параметрыФормы,ЭтаФорма,,,);	
		ФормаВыбора.Открыть();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Склад";
		Сообщение.ПутьКДанным = "Объект.Склад";
		Сообщение.Текст = "В документе не указан склад, подбор не возможен";
		Сообщение.Сообщить();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияДокуменПоступленияИзТранспортировкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ДокументыПоступления.ТекущиеДанные;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДокументПоступления",ТекущаяСтрока.ДокуменПоступленияИзТранспортировки);
	ТекущаяСтрока.ВесПродукцииПоДокументу  = ПолучитьВесИзДокументаПоступления(СтруктураПараметров);
КонецПроцедуры

&НаСервере
Функция ПолучитьВесИзДокументаПоступления(СтрукутраПараметров)
	ИтоговыйВес = 0;
	ДокументПоступления = СтрукутраПараметров.ДокументПоступления;
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда 
		ИтоговыйВес = ДокументПоступления.ОбщийВес;
	КонецЕсли;
	
	Возврат ИтоговыйВес;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.ПоступлениеПродукцииИзТранспортировки.Форма.ФормаВыбора" Тогда 
		СтруктураПоиска  = Новый Структура();
		СтруктураПоиска.Вставить("ДокуменПоступленияИзТранспортировки",ВыбранноеЗначение);
		
		НайденныеСтроки  = Объект.ДокументыПоступления.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда 
			ДобавитьСтрокуДокументаНаСервере(СтруктураПоиска);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуДокументаНаСервере(СтруктураДанных)
	Если ЗначениеЗаполнено(СтруктураДанных.ДокуменПоступленияИзТранспортировки) Тогда
		НоваяСтрока = Объект.ДокументыПоступления.Добавить();
		НоваяСтрока.ДокуменПоступленияИзТранспортировки = СтруктураДанных.ДокуменПоступленияИзТранспортировки;
		НоваяСтрока.ВесПродукцииПоДокументу = НоваяСтрока.ДокуменПоступленияИзТранспортировки.ОбщийВес;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
